export type ServerName =
  | "루페온"
  | "실리안"
  | "아만"
  | "카마인"
  | "카제로스"
  | "아브렐슈드"
  | "카단"
  | "니나브";

export type ClassName =
  | "버서커"
  | "디스트로이어"
  | "워로드"
  | "홀리나이트"
  | "슬레이어"
  | "배틀마스터"
  | "인파이터"
  | "기공사"
  | "창술사"
  | "스트라이커"
  | "브레이커"
  | "데빌헌터"
  | "블래스터"
  | "호크아이"
  | "스카우터"
  | "건슬링어"
  | "아르카나"
  | "서머너"
  | "바드"
  | "소서리스"
  | "데모닉"
  | "블레이드"
  | "리퍼"
  | "소울이터"
  | "도화가"
  | "기상술사"
  | "환수사";

export type Challenge = "Abyss" | "Guardian";

export type WeekContentCategory = "노말" | "하드" | "싱글";
